devdnl/dnx-rtos/src/system/drivers/sdspi/stm32f1/sdspi.c
/*=========================================================================*//**
@file    sdspi.c

@author  Daniel Zorychta

@brief   This file support SD in SPI mode

@note    Copyright (C) 2013 Daniel Zorychta <daniel.zorychta@gmail.com>

         This program is free software; you can redistribute it and/or modify
         it under the terms of the GNU General Public License as published by
         the  Free Software  Foundation;  either version 2 of the License, or
         any later version.

         This  program  is  distributed  in the hope that  it will be useful,
         but  WITHOUT  ANY  WARRANTY;  without  even  the implied warranty of
         MERCHANTABILITY  or  FITNESS  FOR  A  PARTICULAR  PURPOSE.  See  the
         GNU General Public License for more details.

         You  should  have received a copy  of the GNU General Public License
         along  with  this  program;  if not,  write  to  the  Free  Software
         Foundation, Inc., 675 Mass Ave, Cambridge, MA 02139, USA.


*//*==========================================================================*/

#ifdef __cplusplus
extern "C" {
#endif

/*==============================================================================
  Include files
==============================================================================*/
#include "drivers/sdspi.h"
#include "stm32f1/stm32f10x.h"

MODULE_NAME(SDSPI);

/*==============================================================================
  Local symbolic constants/macros
==============================================================================*/
#define MTX_BLOCK_TIME                                  0
#define force_lock_recursive_mutex(mtx)                 while (lock_recursive_mutex(mtx, 10) != MUTEX_LOCKED)

/* SPI configuration macros */
#define enable_bidirectional_data_mode()                SDSPI_PORT->CR1 |=  SPI_CR1_BIDIMODE
#define enable_unidirectional_data_mode()               SDSPI_PORT->CR1 &= ~SPI_CR1_BIDIMODE
#define enable_output_in_bidirectional_data_mode()      SDSPI_PORT->CR1 |=  SPI_CR1_BIDIOE
#define disable_output_in_bidirectional_data_mode()     SDSPI_PORT->CR1 &= ~SPI_CR1_BIDIOE
#define enable_hardware_CRC_calculation()               SDSPI_PORT->CR1 |=  SPI_CR1_CRCEN
#define disable_hardware_CRC_calculation()              SDSPI_PORT->CR1 &= ~SPI_CR1_CRCEN
#define next_trasfer_is_CRC()                           SDSPI_PORT->CR1 |=  SPI_CR1_CRCNEXT
#define next_trasfer_is_data()                          SDSPI_PORT->CR1 &= ~SPI_CR1_CRCNEXT
#define enable_8_bit_data_frame()                       SDSPI_PORT->CR1 &= ~SPI_CR1_DFF
#define enable_16_bit_data_frame()                      SDSPI_PORT->CR1 |=  SPI_CR1_DFF
#define enable_full_duplex()                            SDSPI_PORT->CR1 &= ~SPI_CR1_RXONLY
#define enable_receive_only()                           SDSPI_PORT->CR1 |=  SPI_CR1_RXONLY
#define enable_software_slave_management()              SDSPI_PORT->CR1 |=  SPI_CR1_SSM
#define enable_hardware_slave_management()              SDSPI_PORT->CR1 &= ~SPI_CR1_SSM
#define select_slave_internal()                         SDSPI_PORT->CR1 &= ~SPI_CR1_SSI
#define deselect_slave_internal()                       SDSPI_PORT->CR1 |=  SPI_CR1_SSI
#define transmit_MSB_first()                            SDSPI_PORT->CR1 &= ~SPI_CR1_LSBFIRST
#define transmit_LSB_first()                            SDSPI_PORT->CR1 |=  SPI_CR1_LSBFIRST
#define enable_SPI_peripheral()                         SDSPI_PORT->CR1 |=  SPI_CR1_SPE
#define disable_SPI_peripheral()                        SDSPI_PORT->CR1 &= ~SPI_CR1_SPE
#define FPCLK_DIV_2                                     (0)
#define FPCLK_DIV_4                                     (SPI_CR1_BR_0)
#define FPCLK_DIV_8                                     (SPI_CR1_BR_1)
#define FPCLK_DIV_16                                    (SPI_CR1_BR_1 | SPI_CR1_BR_0)
#define FPCLK_DIV_32                                    (SPI_CR1_BR_2)
#define FPCLK_DIV_64                                    (SPI_CR1_BR_2 | SPI_CR1_BR_0)
#define FPCLK_DIV_128                                   (SPI_CR1_BR_2 | SPI_CR1_BR_1)
#define FPCLK_DIV_256                                   (SPI_CR1_BR_2 | SPI_CR1_BR_1 | SPI_CR1_BR_0)
#define set_baud_rate(baud)                             do{SDSPI_PORT->CR1 &= ~SPI_CR1_BR; SDSPI_PORT->CR1 |= baud;}while(0)
#define enable_master_mode()                            SDSPI_PORT->CR1 |=  SPI_CR1_MSTR
#define enable_slave_mode()                             SDSPI_PORT->CR1 &= ~SPI_CR1_MSTR
#define set_clock_polarity_to_0_when_idle()             SDSPI_PORT->CR1 &= ~SPI_CR1_CPOL
#define set_clock_polarity_to_1_when_idle()             SDSPI_PORT->CR1 |=  SPI_CR1_CPOL
#define capture_on_first_edge()                         SDSPI_PORT->CR1 &= ~SPI_CR1_CPHA
#define capture_on_second_edge()                        SDSPI_PORT->CR1 |=  SPI_CR1_CPHA

#define enable_ISR_when_Tx_buffer_empty()               SDSPI_PORT->CR2 |=  SPI_CR2_TXEIE
#define disbale_ISR_when_Tx_buffer_empty()              SDSPI_PORT->CR2 &= ~SPI_CR2_TXEIE
#define enable_ISR_when_Rx_buffer_not_empty()           SDSPI_PORT->CR2 |=  SPI_CR2_RXNEIE
#define disbale_ISR_when_Rx_buffer_not_empty()          SDSPI_PORT->CR2 &= ~SPI_CR2_RXNEIE
#define enable_ISR_when_error()                         SDSPI_PORT->CR2 |=  SPI_CR2_ERRIE
#define disbale_ISR_when_error()                        SDSPI_PORT->CR2 &= ~SPI_CR2_ERRIE
#define enable_SS_output_in_master_mode()               SDSPI_PORT->CR2 |=  SPI_CR2_SSOE
#define disable_SS_output_in_master_mode()              SDSPI_PORT->CR2 &= ~SPI_CR2_SSOE
#define enable_Tx_Rx_DMA()                              SDSPI_PORT->CR2 |=  SPI_CR2_TXDMAEN | SPI_CR2_RXDMAEN
#define disable_Tx_Rx_DMA()                             SDSPI_PORT->CR2 &= ~(SPI_CR2_TXDMAEN | SPI_CR2_RXDMAEN)

#define is_busy()                                       (SDSPI_PORT->SR & SPI_SR_BSY)
#define is_overrun()                                    (SDSPI_PORT->SR & SPI_SR_OVR)
#define is_mode_fault()                                 (SDSPI_PORT->SR & SPI_SR_MODF)
#define is_CRC_error()                                  (SDSPI_PORT->SR & SPI_SR_CRCERR)
#define is_Tx_buffer_empty()                            (SDSPI_PORT->SR & SPI_SR_TXE)
#define is_Rx_buffer_not_empty()                        (SDSPI_PORT->SR & SPI_SR_RXNE)

#define send_data(data)                                 SDSPI_PORT->DR = data
#define get_data()                                      SDSPI_PORT->DR
#define set_CRC_polynominal(poly)                       SDSPI_PORT->CRCPR = poly
#define get_Rx_CRC()                                    SDSPI_PORT->RXCRCR
#define get_Tx_CRC()                                    SDSPI_PORT->TXCRCR

/* card definitions */
#define CMD0                                            (0x40+0 )       /* GO_IDLE_STATE */
#define CMD1                                            (0x40+1 )       /* SEND_OP_COND (MMC) */
#define ACMD41                                          (0xC0+41)       /* SEND_OP_COND (SDC) */
#define CMD8                                            (0x40+8 )       /* SEND_IF_COND */
#define CMD9                                            (0x40+9 )       /* SEND_CSD */
#define CMD10                                           (0x40+10)       /* SEND_CID */
#define CMD12                                           (0x40+12)       /* STOP_TRANSMISSION */
#define ACMD13                                          (0xC0+13)       /* SD_STATUS (SDC) */
#define CMD16                                           (0x40+16)       /* SET_BLOCKLEN */
#define CMD17                                           (0x40+17)       /* READ_SINGLE_BLOCK */
#define CMD18                                           (0x40+18)       /* READ_MULTIPLE_BLOCK */
#define CMD23                                           (0x40+23)       /* SET_BLOCK_COUNT (MMC) */
#define ACMD23                                          (0xC0+23)       /* SET_WR_BLK_ERASE_COUNT (SDC) */
#define CMD24                                           (0x40+24)       /* WRITE_BLOCK */
#define CMD25                                           (0x40+25)       /* WRITE_MULTIPLE_BLOCK */
#define CMD55                                           (0x40+55)       /* APP_CMD */
#define CMD58                                           (0x40+58)       /* READ_OCR */

#define CT_MMC                                          (1 << 0)
#define CT_SD1                                          (1 << 1)
#define CT_SD2                                          (1 << 2)
#define CT_SDC                                          (CT_SD1|CT_SD2)
#define CT_BLOCK                                        (1 << 3)

#define SECTOR_SIZE                                     512

/* MBR definitions */
#define MBR_BOOTSTRAP_CODE_OFFSET                       0x000
#define MBR_PARTITION_1_ENTRY_OFFSET                    0x1BE
#define MBR_PARTITION_2_ENTRY_OFFSET                    0x1CE
#define MBR_PARTITION_3_ENTRY_OFFSET                    0x1DE
#define MBR_PARTITION_4_ENTRY_OFFSET                    0x1EE
#define MBR_BOOT_SIGNATURE_OFFSET                       0x1FE

#define MBR_PARITION_ENTRY_STATUS_OFFSET                0x00
#define MBR_PARITION_ENTRY_CHS_FIRST_ADDR_OFFSET        0x01
#define MBR_PARITION_ENTRY_PARTITION_TYPE_OFFSET        0x04
#define MBR_PARITION_ENTRY_CHS_LAST_ADDR_OFFSET         0x05
#define MBR_PARITION_ENTRY_LBA_FIRST_ADDR_OFFSET        0x08
#define MBR_PARITION_ENTRY_NUM_OF_SECTORS_OFFSET        0x0C

#define LOAD_U32(buff, offset)                          (u32_t)(((u32_t)buff[offset + 0]) | ((u32_t)buff[offset + 1] << 8) | ((u32_t)buff[offset + 2] << 16) | ((u32_t)buff[offset + 3] << 24))
#define LOAD_U16(buff, offset)                          (u16_t)(((u16_t)buff[offset + 0]) | ((u16_t)buff[offset + 1] << 8))

#define MBR_GET_BOOT_SIGNATURE(sector)                  LOAD_U16(sector, MBR_BOOT_SIGNATURE_OFFSET)
#define MBR_GET_PARTITION_1_LBA_FIRST_SECTOR(sector)    LOAD_U32(sector, MBR_PARTITION_1_ENTRY_OFFSET + MBR_PARITION_ENTRY_LBA_FIRST_ADDR_OFFSET)
#define MBR_GET_PARTITION_2_LBA_FIRST_SECTOR(sector)    LOAD_U32(sector, MBR_PARTITION_2_ENTRY_OFFSET + MBR_PARITION_ENTRY_LBA_FIRST_ADDR_OFFSET)
#define MBR_GET_PARTITION_3_LBA_FIRST_SECTOR(sector)    LOAD_U32(sector, MBR_PARTITION_3_ENTRY_OFFSET + MBR_PARITION_ENTRY_LBA_FIRST_ADDR_OFFSET)
#define MBR_GET_PARTITION_4_LBA_FIRST_SECTOR(sector)    LOAD_U32(sector, MBR_PARTITION_4_ENTRY_OFFSET + MBR_PARITION_ENTRY_LBA_FIRST_ADDR_OFFSET)
#define MBR_GET_PARTITION_1_NUMBER_OF_SECTORS(sector)   LOAD_U32(sector, MBR_PARTITION_1_ENTRY_OFFSET + MBR_PARITION_ENTRY_NUM_OF_SECTORS_OFFSET)
#define MBR_GET_PARTITION_2_NUMBER_OF_SECTORS(sector)   LOAD_U32(sector, MBR_PARTITION_2_ENTRY_OFFSET + MBR_PARITION_ENTRY_NUM_OF_SECTORS_OFFSET)
#define MBR_GET_PARTITION_3_NUMBER_OF_SECTORS(sector)   LOAD_U32(sector, MBR_PARTITION_3_ENTRY_OFFSET + MBR_PARITION_ENTRY_NUM_OF_SECTORS_OFFSET)
#define MBR_GET_PARTITION_4_NUMBER_OF_SECTORS(sector)   LOAD_U32(sector, MBR_PARTITION_4_ENTRY_OFFSET + MBR_PARITION_ENTRY_NUM_OF_SECTORS_OFFSET)

/*==============================================================================
  Local types, enums definitions
==============================================================================*/
/* partition description */
struct partition {
        u32_t    first_sector;
        u32_t    size_in_sectors;
        bool     in_use;
};

/** card types */
typedef u8_t card_type;

