devdnl/dnx-rtos/src/system/drivers/sdspi/stm32f1/sdspi.c
/** handling structure */
struct sdspi_data {
        FILE            *gpio_file;
        card_type        card_type;
        bool             card_initialized;
        mutex_t         *card_protect_mtx;
        struct partition partition[4];
#if (SDSPI_ENABLE_DMA != 0)
        volatile bool    DMA_tansaction_finished;
#endif
};

/*==============================================================================
  Local function prototypes
==============================================================================*/
static stdret_t         turn_on_SPI_clock       (void);
static stdret_t         turn_off_SPI_clock      (void);
static u8_t             send_cmd                (struct sdspi_data *sdspi, u8_t cmd, u32_t arg);
static u8_t             wait_ready              (void);
static u8_t             spi_rw                  (u8_t out);
static bool             receive_data_block      (u8_t *buff);
static bool             transmit_data_block     (const u8_t *buff, u8_t token);
static size_t           read_whole_sectors      (struct sdspi_data *hdl, void *dst, size_t nsectors, u64_t lseek);
static size_t           read_partial_sectors    (struct sdspi_data *hdl, void *dst, size_t size, u64_t lseek);
static size_t           write_whole_sectors     (struct sdspi_data *hdl, const void *src, size_t nsectors, u64_t lseek);
static size_t           write_partial_sectors   (struct sdspi_data *hdl, const void *src, size_t size, u64_t lseek);
static stdret_t         initialize_card         (struct sdspi_data *hdl);
static stdret_t         detect_partitions       (struct sdspi_data *hdl);
static size_t           card_read               (struct sdspi_data *hdl, void *dst, size_t size, size_t nitems, u64_t lseek);
static size_t           card_write              (struct sdspi_data *hdl, const void *src, size_t size, size_t nitems, u64_t lseek);

/*==============================================================================
  Local object definitions
==============================================================================*/
static struct sdspi_data *sdspi_data;

/*==============================================================================
  Function definitions
==============================================================================*/

//==============================================================================
/**
 * @brief Initialize device
 *
 * @param[out] **drvhdl         driver's memory handler
 * @param[in]  dev              device number
 * @param[in]  part             device part
 *
 * @retval STD_RET_OK
 * @retval STD_RET_ERROR
 */
//==============================================================================
stdret_t SDSPI_init(void **drvhdl, uint dev, uint part)
{
        _stop_if(!drvhdl);

        if (dev != SDSPI_DEV_NO || part != SDSPI_DEV_PART) {
                return STD_RET_ERROR;
        }

        struct sdspi_data *sdspi;
        if (!(sdspi = calloc(1, sizeof(struct sdspi_data)))) {
                return STD_RET_ERROR;
        }

        *drvhdl    = sdspi;
        sdspi_data = sdspi;

#if (SDSPI_ENABLE_DMA != 0)
        if ((u32_t)SDSPI_DMA == DMA1_BASE) {
                RCC->AHBENR |= RCC_AHBENR_DMA1EN;
        } else if ((u32_t)SDSPI_DMA == DMA2_BASE) {
                RCC->AHBENR |= RCC_AHBENR_DMA2EN;
        }

        NVIC_SetPriority(SDSPI_DMA_IRQ, SDSPI_DMA_IRQ_PRIORITY);
#endif

        if (!(sdspi->card_protect_mtx = new_mutex())) {
                goto error;
        }

        if (!(sdspi->gpio_file = vfs_fopen(SDSPI_GPIO_FILE, "r+"))) {
                goto error;
        }

        /* initialize SPI interface */
        if (turn_on_SPI_clock() != STD_RET_OK) {
                goto error;
        }

        enable_SS_output_in_master_mode();
        enable_unidirectional_data_mode();
        disable_hardware_CRC_calculation();
        enable_8_bit_data_frame();
        enable_software_slave_management();
        transmit_MSB_first();

#if   (SDSPI_PERIPERAL_DIVIDER <=   2)
        set_baud_rate(FPCLK_DIV_2);
#elif (SDSPI_PERIPERAL_DIVIDER <=   4)
        set_baud_rate(FPCLK_DIV_4);
#elif (SDSPI_PERIPERAL_DIVIDER <=   8)
        set_baud_rate(FPCLK_DIV_8);
#elif (SDSPI_PERIPERAL_DIVIDER <=  16)
        set_baud_rate(FPCLK_DIV_16);
#elif (SDSPI_PERIPERAL_DIVIDER <=  32)
        set_baud_rate(FPCLK_DIV_32);
#elif (SDSPI_PERIPERAL_DIVIDER <=  64)
        set_baud_rate(FPCLK_DIV_64);
#elif (SDSPI_PERIPERAL_DIVIDER <= 128)
        set_baud_rate(FPCLK_DIV_128);
#else
        set_baud_rate(FPCLK_DIV_256);
#endif

        enable_master_mode();
        set_clock_polarity_to_0_when_idle();
        capture_on_first_edge();
        enable_SPI_peripheral();

        return STD_RET_OK;

error:
        if (sdspi) {
                if (sdspi->card_protect_mtx) {
                        delete_mutex(sdspi->card_protect_mtx);
                }

                if (sdspi->gpio_file) {
                        vfs_fclose(sdspi->gpio_file);
                }

                free(sdspi);
        }
        return STD_RET_ERROR;
}

//==============================================================================
/**
 * @brief Release device
 *
 * @param[in] *drvhdl           driver's memory handler
 *
 * @retval STD_RET_OK
 * @retval STD_RET_ERROR
 */
//==============================================================================
stdret_t SDSPI_release(void *drvhdl)
{
        _stop_if(!drvhdl);

        struct sdspi_data *hdl = drvhdl;

        /* wait for all partition are released */
        int timeout = 50;
        while (  hdl->partition[0].in_use == true
              || hdl->partition[1].in_use == true
              || hdl->partition[2].in_use == true
              || hdl->partition[3].in_use == true) {

                if (--timeout == 0)
                        return STD_RET_ERROR;

                sleep_ms(100);
        }

        lock_mutex(hdl->card_protect_mtx, MAX_DELAY);
        enter_critical_section();
        unlock_mutex(hdl->card_protect_mtx);
        delete_mutex(hdl->card_protect_mtx);
        vfs_fclose(hdl->gpio_file);
        turn_off_SPI_clock();
        free(hdl);
        exit_critical_section();

