devdnl/dnx-rtos/src/system/drivers/sdspi/stm32f1/sdspi.c
        return STD_RET_OK;
}

//==============================================================================
/**
 * @brief Opens specified port
 *
 * @param[in] *drvhdl           driver's memory handler
 *
 * @retval STD_RET_OK
 * @retval STD_RET_ERROR
 */
//==============================================================================
stdret_t SDSPI_open(void *drvhdl)
{
        _stop_if(!drvhdl);

        return STD_RET_OK;
}

//==============================================================================
/**
 * @brief Function close opened port
 *
 * @param[in] *drvhdl           driver's memory handler
 *
 * @retval STD_RET_OK
 * @retval STD_RET_ERROR
 */
//==============================================================================
stdret_t SDSPI_close(void *drvhdl)
{
        _stop_if(!drvhdl);

        return STD_RET_OK;
}

//==============================================================================
/**
 * @brief Write data
 *
 * @param[in] *drvhdl           driver's memory handle
 * @param[in] *src              source
 * @param[in]  size             item size
 * @param[in]  nitems           n-items to write
 * @param[in]  lseek            file index
 *
 * @retval number of written nitems
 */
//==============================================================================
size_t SDSPI_write(void *drvhdl, const void *src, size_t size, size_t nitems, u64_t lseek)
{
        _stop_if(!drvhdl);
        _stop_if(!src);
        _stop_if(!size);
        _stop_if(!nitems);

        struct sdspi_data *hdl = drvhdl;

        size_t n = 0;
        if (lock_mutex(hdl->card_protect_mtx, MAX_DELAY) == MUTEX_LOCKED) {
                n = card_write(hdl, src, size, nitems, lseek);
                unlock_mutex(hdl->card_protect_mtx);
        }

        return n;
}

//==============================================================================
/**
 * @brief Read data (read 512 byte sector)
 *
 * @param[in]  *drvhdl          driver's memory handle
 * @param[out] *dst             destination
 * @param[in]   size            item size
 * @param[in]   nitems          n-items to read
 * @param[in]   lseek           file index
 *
 * @retval number of read nitems
 */
//==============================================================================
size_t SDSPI_read(void *drvhdl, void *dst, size_t size, size_t nitems, u64_t lseek)
{
        _stop_if(!drvhdl);
        _stop_if(!dst);
        _stop_if(!size);
        _stop_if(!nitems);

        struct sdspi_data *hdl = drvhdl;

        size_t n = 0;
        if (lock_mutex(hdl->card_protect_mtx, MAX_DELAY) == MUTEX_LOCKED) {
                n = card_read(hdl, dst, size, nitems, lseek);
                unlock_mutex(hdl->card_protect_mtx);
        }

        return n;
}

//==============================================================================
/**SDSPI_SPI
 * @brief Direct IO control
 *
 * @param[in]     *drvhdl       driver's memory handle
 * @param[in]      iorq         IO request
 * @param[in,out]  args         additional arguments
 *
 * @retval STD_RET_OK
 * @retval STD_RET_ERROR
 */
//==============================================================================
stdret_t SDSPI_ioctl(void *drvhdl, int iorq, va_list args)
{
        _stop_if(!drvhdl);

        struct sdspi_data *hdl = drvhdl;

        stdret_t status = STD_RET_OK;

        switch (iorq) {
        case SDSPI_IORQ_INITIALIZE_CARD:
                if (lock_mutex(hdl->card_protect_mtx, MTX_BLOCK_TIME) == MUTEX_LOCKED) {
                        bool *result = va_arg(args, bool*);
                        *result      = false;

                        vfs_remove(SDSPI_PARTITION_1_PATH);
                        vfs_remove(SDSPI_PARTITION_2_PATH);
                        vfs_remove(SDSPI_PARTITION_3_PATH);
                        vfs_remove(SDSPI_PARTITION_4_PATH);

                        if (initialize_card(hdl) == STD_RET_OK) {
                                if (detect_partitions(hdl) == STD_RET_OK) {
                                        *result = true;
                                }
                        }

                        unlock_mutex(hdl->card_protect_mtx);
                } else {
                        status = STD_RET_ERROR;
                }
                break;

        default:
                status = STD_RET_ERROR;
                break;
        }

        return status;
}

//==============================================================================
/**
 * @brief Function flush device
 *
 * @param[in] *drvhdl           driver's memory handle
 *
 * @retval STD_RET_OK
 * @retval STD_RET_ERROR
 */
//==============================================================================
stdret_t SDSPI_flush(void *drvhdl)
{
        (void)drvhdl;

        return STD_RET_OK;
}

//==============================================================================
/**
 * @brief Function returns device informations
 *
 * @param[in]  *drvhld          driver's memory handle
 * @param[out] *info            device/file info
 *
 * @retval STD_RET_OK
 * @retval STD_RET_ERROR
 */
//==============================================================================
stdret_t SDSPI_info(void *drvhdl, struct vfs_dev_info *info)
{
        _stop_if(!drvhdl);
        _stop_if(!info);

        struct sdspi_data *hdl = drvhdl;

        /* size info */
        if (send_cmd(hdl, CMD9, 0) == 0) {
                u8_t  csd[16];
                u8_t  token;
                uint  try = 1000000;

                while ((token = spi_rw(0xFF)) == 0xFF && --try);
                if (token != 0xFE)
                        return STD_RET_ERROR;

                u8_t *ptr = &csd[0];
                for (int i = 0; i < 4; i++) {
                        *ptr++ = spi_rw(0xFF);
                        *ptr++ = spi_rw(0xFF);
                        *ptr++ = spi_rw(0xFF);
                        *ptr++ = spi_rw(0xFF);
                }
                spi_rw(0xFF);
                spi_rw(0xFF);

                /* SDC version 2.00 */
                info->st_size = 0;
                if ((csd[0] >> 6) == 1) {
                        int csize     = csd[9] + ((u16_t)csd[8] << 8) + 1;
                        info->st_size = (u64_t)csize << 10;
                } else { /* SDC version 1.XX or MMC*/
                        int n     = (csd[5] & 15) + ((csd[10] & 128) >> 7) + ((csd[9] & 3) << 1) + 2;
                        int csize = (csd[8] >> 6) + ((u16_t)csd[7] << 2) + ((u16_t)(csd[6] & 3) << 10) + 1;
                        info->st_size = (u64_t)csize << (n - 9);
                }
                info->st_size *= SECTOR_SIZE;
        }

