devdnl/dnx-rtos/src/system/drivers/sdspi/stm32f1/sdspi.c
        return STD_RET_OK;
}

//==============================================================================
/**
 * @brief Function open new partiotion file
 *
 * @param[in] *drvhdl   handler to partition description
 *
 * @retval STD_RET_OK
 * @retval STD_RET_ERROR
 */
//==============================================================================
static stdret_t partition_open(void *drvhdl)
{
        _stop_if(!drvhdl);

        struct partition *hdl = drvhdl;

        if (hdl->in_use == true)
                return STD_RET_ERROR;
        else
                return STD_RET_OK;
}

//==============================================================================
/**
 * @brief Function close partition file
 *
 * @param[in] *drvhdl   handler to partition description
 *
 * @retval STD_RET_OK
 * @retval STD_RET_ERROR
 */
//==============================================================================
static stdret_t partition_close(void *drvhdl)
{
        _stop_if(!drvhdl);

        struct partition *hdl = drvhdl;

        hdl->in_use = false;
        return STD_RET_OK;
}

//==============================================================================
/**
 * @brief Function write data to partition file
 *
 * @param[in] *drvhdl           handler to partition description
 * @param[in] *src              source
 * @param[in]  size             item size
 * @param[in]  nitems           n-items to write
 * @param[in]  lseek            file index
 *
 * @retval number of written nitems
 */
//==============================================================================
static size_t partition_write(void *drvhdl, const void *src, size_t size, size_t nitems, u64_t lseek)
{
        _stop_if(!drvhdl);
        _stop_if(!src);
        _stop_if(!size);
        _stop_if(!nitems);

        struct partition *hdl = drvhdl;

        size_t n = 0;
        if (lock_mutex(sdspi_data->card_protect_mtx, MAX_DELAY) == MUTEX_LOCKED) {
                n = card_write(sdspi_data, src, size, nitems, lseek + ((u64_t)hdl->first_sector * SECTOR_SIZE));
                unlock_mutex(sdspi_data->card_protect_mtx);
        }

        return n;
}

//==============================================================================
/**
 * @brief Function read data from partition file
 *
 * @param[in]  *drvhdl          handler to partition description
 * @param[out] *dst             destination
 * @param[in]   size            item size
 * @param[in]   nitems          n-items to read
 * @param[in]   lseek           file index
 *
 * @retval number of written nitems
 */
//==============================================================================
static size_t partition_read(void *drvhdl, void *dst, size_t size, size_t nitems, u64_t lseek)
{
        _stop_if(!drvhdl);
        _stop_if(!dst);
        _stop_if(!size);
        _stop_if(!nitems);

        struct partition *hdl = drvhdl;

        size_t n = 0;
        if (lock_mutex(sdspi_data->card_protect_mtx, MAX_DELAY) == MUTEX_LOCKED) {
                n = card_read(sdspi_data, dst, size, nitems, lseek + ((u64_t)hdl->first_sector * SECTOR_SIZE));
                unlock_mutex(sdspi_data->card_protect_mtx);
        }

        return n;
}

//==============================================================================
/**
 * @brief Function control partition
 *
 * @param[in]    *drvhdl        handler to partition description
 * @param[in]     iorq          IO request
 * @param[in,out] args          additional arguments
 *
 * @retval STD_RET_OK
 * @retval STD_RET_ERROR
 */
//==============================================================================
static stdret_t partition_ioctl(void *drvhdl, int iorq, va_list args)
{
        (void) drvhdl;
        (void) iorq;
        (void) args;

        return STD_RET_ERROR;
}

//==============================================================================
/**
 * @brief Function flush partition
 *
 * @param[in] *drvhdl           handler to partition description
 *
 * @retval STD_RET_OK
 * @retval STD_RET_ERROR
 */
//==============================================================================
static stdret_t partition_flush(void *drvhdl)
{
        (void) drvhdl;

        return STD_RET_OK;
}

//==============================================================================
/**
 * @brief Function returns device informations
 *
 * @param[in]  *drvhld          driver's memory handle
 * @param[out] *info            device/file info
 *
 * @retval STD_RET_OK
 * @retval STD_RET_ERROR
 */
//==============================================================================
stdret_t partition_info(void *drvhdl, struct vfs_dev_info *info)
{
        _stop_if(!drvhdl);
        _stop_if(!info);

        struct partition *hdl = drvhdl;
        info->st_size = (u64_t)hdl->size_in_sectors * SECTOR_SIZE;
        return STD_RET_OK;
}

//==============================================================================
/**
 * @brief Function turn on SPI clock
 *
 * @retval STD_RET_OK
 * @retval STD_RET_ERROR
 */
//==============================================================================
static stdret_t turn_on_SPI_clock(void)
{
        switch ((u32_t)SDSPI_PORT) {
        #if defined(RCC_APB2ENR_SPI1EN)
        case SPI1_BASE:
                RCC->APB2ENR |= RCC_APB2ENR_SPI1EN;
                return STD_RET_OK;
        #endif
        #if defined(RCC_APB1ENR_SPI2EN)
        case SPI2_BASE:
                RCC->APB1ENR |= RCC_APB1ENR_SPI2EN;
                return STD_RET_OK;
        #endif
        #if defined(RCC_APB1ENR_SPI3EN)
        case SPI3_BASE:
                RCC->APB1ENR |= RCC_APB1ENR_SPI3EN;
                return STD_RET_OK;
        #endif
        default:
                return STD_RET_ERROR;
        }
}

//==============================================================================
/**
 * @brief Function turn off SPI clock
 *
 * @retval STD_RET_OK
 * @retval STD_RET_ERROR
 */
//==============================================================================
static stdret_t turn_off_SPI_clock(void)
{
        switch ((u32_t)SDSPI_PORT) {
        #if defined(RCC_APB2ENR_SPI1EN)
        case SPI1_BASE:
                RCC->APB2RSTR |=  RCC_APB2RSTR_SPI1RST;
                RCC->APB2RSTR &= ~RCC_APB2RSTR_SPI1RST;
                RCC->APB2ENR  &= ~RCC_APB2ENR_SPI1EN;
                return STD_RET_OK;
        #endif
        #if defined(RCC_APB1ENR_SPI2EN)
        case SPI2_BASE:
                RCC->APB1RSTR |=  RCC_APB1RSTR_SPI2RST;
                RCC->APB1RSTR &= ~RCC_APB1RSTR_SPI2RST;
                RCC->APB1ENR  &= ~RCC_APB1ENR_SPI2EN;
                return STD_RET_OK;
        #endif
        #if defined(RCC_APB1ENR_SPI3EN)
        case SPI3_BASE:
                RCC->APB1RSTR |=  RCC_APB1RSTR_SPI3RST;
                RCC->APB1RSTR &= ~RCC_APB1RSTR_SPI3RST;
                RCC->APB1ENR  &= ~RCC_APB1ENR_SPI3EN;
                return STD_RET_OK;
        #endif
        default:
                return STD_RET_ERROR;
        }
}

//==============================================================================
/**
 * @brief Function send byte by SPI peripheral
 *
 * @param[in] out       data to send
 *
 * @return received byte
 */
//==============================================================================
static u8_t spi_rw(u8_t out)
{
        send_data(out);
        while (!is_Rx_buffer_not_empty());
        return get_data();
}

//==============================================================================
/**
 * @brief Function wait for card ready
 *
 * @return card response
 */
//==============================================================================
static u8_t wait_ready(void)
{
        int  try = 1000000;
        u8_t response;

        spi_rw(0xFF);

        while ((response = spi_rw(0xFF)) != 0xFF && --try);

        return response;
}

//==============================================================================
/**
 * @brief Function transmit command to card
 *
 * @param[in] *sdspi    SD SPI interface data
 * @param[in] cmd       card command
 * @param[in] arg       command's argument
 */
//==============================================================================
static u8_t send_cmd(struct sdspi_data *sdspi, u8_t cmd, u32_t arg)
{
        u8_t response;

        /* ACMD<n> is the command sequence of CMD55-CMD<n> */
        if (cmd & 0x80) {
                cmd &= 0x7F;
                response = send_cmd(sdspi, CMD55, 0);
                if (response > 1)
                        return response;
        }

        /* select the card and wait for ready */
        vfs_ioctl(sdspi->gpio_file, GPIO_IORQ_SD_DESELECT);
        vfs_ioctl(sdspi->gpio_file, GPIO_IORQ_SD_SELECT);

