devdnl/dnx-rtos/src/system/drivers/sdspi/stm32f1/sdspi.c
        if (wait_ready() != 0xFF) {
                return 0xFF;
        }

        /* send command packet */
        spi_rw(cmd);                    /* Start + Command index */
        spi_rw(arg >> 24);              /* Argument[31..24]      */
        spi_rw(arg >> 16);              /* Argument[23..16]      */
        spi_rw(arg >> 8);               /* Argument[15..8]       */
        spi_rw(arg);

        if (cmd == CMD0)
                spi_rw(0x95);           /* Valid CRC for CMD0(0) */
        else if (cmd == CMD8)
                spi_rw(0x87);           /* Valid CRC for CMD8(0x1AA) */
        else
                spi_rw(0x01);           /* Dummy CRC + Stop */

        /* receive command response */
        if (cmd == CMD12)
                spi_rw(0xFF);           /* Skip a stuff byte when stop reading */

        /* wait for a valid response in timeout of 10 attempts */
        int n = 10;
        do {
                response = spi_rw(0xFF);
        } while ((response & 0x80) && --n);

        return response;
}

//==============================================================================
/**
 * @brief Function receive data block
 *
 * @param[out] *buff            data buffer (sector size)
 *
 * @retval true if success
 * @retval false if error
 */
//==============================================================================
static bool receive_data_block(u8_t *buff)
{
        u8_t token;
        uint try = 1000000;

        while ((token = spi_rw(0xFF)) == 0xFF && --try);

        if (token != 0xFE)
                return false;

#if (SDSPI_ENABLE_DMA != 0)
        SDSPI_DMA_RX_CHANNEL->CPAR  = (u32_t)&SDSPI_PORT->DR;
        SDSPI_DMA_RX_CHANNEL->CMAR  = (u32_t)buff;
        SDSPI_DMA_RX_CHANNEL->CNDTR = SECTOR_SIZE;
        SDSPI_DMA_RX_CHANNEL->CCR   = DMA_CCR1_MINC | DMA_CCR1_TCIE | DMA_CCR1_EN;
        NVIC_EnableIRQ(SDSPI_DMA_IRQ);

        u16_t dummy = 0xFFFF;
        SDSPI_DMA_TX_CHANNEL->CPAR  = (u32_t)&SDSPI_PORT->DR;
        SDSPI_DMA_TX_CHANNEL->CMAR  = (u32_t)&dummy;
        SDSPI_DMA_TX_CHANNEL->CNDTR = SECTOR_SIZE;
        SDSPI_DMA_TX_CHANNEL->CCR   = DMA_CCR1_DIR | DMA_CCR1_EN;

        sdspi_data->DMA_tansaction_finished = false;

        enable_Tx_Rx_DMA();

        while (sdspi_data->DMA_tansaction_finished == false);

#else
        /* memory alignment */
        int size = SECTOR_SIZE;
        do {
                *buff++ = spi_rw(0xFF);
                *buff++ = spi_rw(0xFF);
                *buff++ = spi_rw(0xFF);
                *buff++ = spi_rw(0xFF);
        } while (size -= 4);
#endif

        /* discard CRC */
        spi_rw(0xFF);
        spi_rw(0xFF);

        return true;
}

//==============================================================================
/**
 * @brief Function transmit data block
 *
 * @param[in] *buff             source buffer (sector size)
 * @param[in]  toke             token to send
 *
 * @retval true if success
 * @retval false if error
 */
//==============================================================================
static bool transmit_data_block(const u8_t *buff, u8_t token)
{
        if (wait_ready() != 0xFF)
                return false;

        spi_rw(token);

        if (token != 0xFD) {
#if (SDSPI_ENABLE_DMA != 0)
                u16_t dummy;
                SDSPI_DMA_RX_CHANNEL->CMAR  = (u32_t)&dummy;
                SDSPI_DMA_RX_CHANNEL->CPAR  = (u32_t)&SDSPI_PORT->DR;
                SDSPI_DMA_RX_CHANNEL->CNDTR = SECTOR_SIZE;
                SDSPI_DMA_RX_CHANNEL->CCR   = DMA_CCR1_TCIE | DMA_CCR1_EN;
                NVIC_EnableIRQ(SDSPI_DMA_IRQ);

                SDSPI_DMA_TX_CHANNEL->CMAR  = (u32_t)buff;
                SDSPI_DMA_TX_CHANNEL->CPAR  = (u32_t)&SDSPI_PORT->DR;
                SDSPI_DMA_TX_CHANNEL->CNDTR = SECTOR_SIZE;
                SDSPI_DMA_TX_CHANNEL->CCR   = DMA_CCR1_MINC | DMA_CCR1_DIR | DMA_CCR1_EN;

                sdspi_data->DMA_tansaction_finished = false;

                enable_Tx_Rx_DMA();

                while (sdspi_data->DMA_tansaction_finished == false);

#else
                int size = SECTOR_SIZE;
                do {
                        spi_rw(*buff++);
                        spi_rw(*buff++);
                        spi_rw(*buff++);
                        spi_rw(*buff++);
                } while (size -= 4);
#endif

                /* CRC dummy */
                spi_rw(0xFF);
                spi_rw(0xFF);

                /* receive data response */
                if ((spi_rw(0xFF) & 0x1F) != 0x05)
                        return false;
        }

        return true;
}

//==============================================================================
/**
 * @brief Function read whole sectors
 *
 * @param[in]  *hdl             driver's memory handle
 * @param[out] *dst             destination
 * @param[in]   nsectors        sectors to read
 * @param[in]   lseek           file index
 *
 * @retval number of read sectors
 */
//==============================================================================
static size_t read_whole_sectors(struct sdspi_data *hdl, void *dst, size_t nsectors, u64_t lseek)
{
        size_t n = 0;

        if (hdl->card_type & CT_BLOCK) {
                lseek >>= 9;    /* divide by 512 */
        }

        /* 1 sector to read */
        if (nsectors == 1) {
                if (send_cmd(hdl, CMD17, (u32_t)lseek) == 0) {
                        if (receive_data_block(dst)) {
                                n = 1;
                        }
                }
        } else {
                if (send_cmd(hdl, CMD18, (u32_t)lseek) == 0) {
                        do {
                                if (!receive_data_block(dst)) {
                                        break;
                                }

                                dst += SECTOR_SIZE;
                        } while (++n < nsectors);

                        /* stop transmission */
                        send_cmd(hdl, CMD12, 0);
                }
        }

        return n;
}

//==============================================================================
/**
 * @brief Function read only selected data from sectors
 *
 * @param[in]  *hdl             driver's memory handle
 * @param[out] *dst             destination
 * @param[in]   size            number of bytes to read
 * @param[in]   lseek           file index
 *
 * @retval number of read bytes
 */
//==============================================================================
static size_t read_partial_sectors(struct sdspi_data *hdl, void *dst, size_t size, u64_t lseek)
{
        u8_t *buffer = malloc(SECTOR_SIZE);
        if (!buffer)
                return 0;

        u32_t recv_data  = 0;
        while (recv_data < size) {
                if (lseek % SECTOR_SIZE == 0 && (size - recv_data) / SECTOR_SIZE > 0) {
                        size_t n = read_whole_sectors(hdl, dst, size / SECTOR_SIZE, lseek);
                        if (n != size / SECTOR_SIZE)
                                break;

                        dst       += n * SECTOR_SIZE;
                        lseek     += n * SECTOR_SIZE;
                        recv_data += n * SECTOR_SIZE;
                } else {
                        if (read_whole_sectors(hdl, buffer, 1, lseek & ~(0x1FF)) != 1)
                                break;

                        u32_t rest;
                        if ((SECTOR_SIZE - (lseek % SECTOR_SIZE)) > (size - recv_data))
                                rest = size - recv_data;
                        else
                                rest = SECTOR_SIZE - (lseek % SECTOR_SIZE);

